alpha11/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Nodes;
    patches           (walls);
    locations         faceNodes;
    
    readData
    (
      DisplacementDelta
    );
    
    writeData
    (
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Faces;
    patches           (walls);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Force
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1000;
}
